{
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-JAM",
    "2": "I-JAM",
    "3": "B-FLOOD",
    "4": "I-FLOOD",
    "5": "B-OBSTACLE",
    "6": "I-OBSTACLE",
    "7": "B-POLICE",
    "8": "I-POLICE",
    "9": "B-LOCATION",
    "10": "I-LOCATION",
    "11": "B-VELOCITY",
    "12": "I-VELOCITY"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-FLOOD": 3,
    "B-JAM": 1,
    "B-LOCATION": 9,
    "B-OBSTACLE": 5,
    "B-POLICE": 7,
    "B-VELOCITY": 11,
    "I-FLOOD": 4,
    "I-JAM": 2,
    "I-LOCATION": 10,
    "I-OBSTACLE": 6,
    "I-POLICE": 8,
    "I-VELOCITY": 12,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 258,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "tokenizer_class": "PhobertTokenizer",
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 64001
}
